espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dma2d_struct.h
/**
 * SPDX-FileCopyrightText: 2023-2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: out */
/** Type of out_conf0_chn register
 *  Configures the tx direction of channel 0
 */
typedef union {
    struct {
        /** out_auto_wrback_chn : R/W; bitpos: [0]; default: 0;
         *  Set this bit to enable automatic outlink-writeback when all the data pointed by
         *  outlink descriptor has been received.
         */
        uint32_t out_auto_wrback_chn:1;
        /** out_eof_mode_chn : R/W; bitpos: [1]; default: 1;
         *  EOF flag generation mode when receiving data. 1: EOF flag for Tx channel 0 is
         *  generated when data need to read has been popped from FIFO in DMA
         */
        uint32_t out_eof_mode_chn:1;
        /** outdscr_burst_en_chn : R/W; bitpos: [2]; default: 0;
         *  Set this bit to 1 to enable INCR burst transfer for Tx channel 0 reading link
         *  descriptor when accessing internal SRAM.
         */
        uint32_t outdscr_burst_en_chn:1;
        /** out_ecc_aes_en_chn : R/W; bitpos: [3]; default: 0;
         *  When access address space is ecc/aes area, this bit should be set to 1. In this
         *  case, the start address of square should be 16-byte aligned. The width of square
         *  multiply byte number of one pixel should be 16-byte aligned.
         *
         *  2D-DMA w/ flash encryption enabled can still work properly even if this bit is not set to 1
         *  Meanwhile, enabling this bit will restrict addr and size in internal RAM also has to be 16-byte aligned
         *  Therefore, this bit is not used.
         */
        uint32_t out_ecc_aes_en_chn:1;
        /** out_check_owner_chn : R/W; bitpos: [4]; default: 0;
         *  Set this bit to enable checking the owner attribute of the link descriptor.
         */
        uint32_t out_check_owner_chn:1;
        /** out_loop_test_chn : R/W; bitpos: [5]; default: 0;
         *  reserved
         */
        uint32_t out_loop_test_chn:1;
        /** out_mem_burst_length_chn : R/W; bitpos: [8:6]; default: 0;
         *  Block size of Tx channel 0. 0: 8 bytes      1: 16 bytes      2: 32 bytes    3: 64
         *  bytes    4: 128 bytes
         */
        uint32_t out_mem_burst_length_chn:3;
        /** out_macro_block_size_chn : R/W; bitpos: [10:9]; default: 0;
         *  Sel TX macro-block size 0: 8pixel*8pixel     1: 8pixel*16pixel     2:
         *  16pixel*16pixel     3: no macro-block     , only useful in mode 1 of the link
         *  descriptor
         */
        uint32_t out_macro_block_size_chn:2;
        /** out_dscr_port_en_chn : R/W; bitpos: [11]; default: 0;
         *  Set this bit to 1 to obtain descriptor from IP port
         */
        uint32_t out_dscr_port_en_chn:1;
        /** out_page_bound_en_chn : R/W; bitpos: [12]; default: 0;
         *  Set this bit to 1 to make sure AXI read data don't cross the address boundary which
         *  define by mem_burst_length
         */
        uint32_t out_page_bound_en_chn:1;
        uint32_t reserved_13:3;
        /** out_reorder_en_chn : R/W; bitpos: [16]; default: 0;
         *  Enable TX channel 0 macro block reorder when set to 1, only channel0 have this
         *  selection
         */
        uint32_t out_reorder_en_chn:1;
        uint32_t reserved_17:7;
        /** out_rst_chn : R/W; bitpos: [24]; default: 0;
         *  Write 1 then write 0 to this bit to reset TX channel
         */
        uint32_t out_rst_chn:1;
        /** out_cmd_disable_chn : R/W; bitpos: [25]; default: 0;
         *  Write 1 before reset and write 0 after reset
         */
        uint32_t out_cmd_disable_chn:1;
        /** out_arb_weight_opt_dis_chn : R/W; bitpos: [26]; default: 0;
         *  Set this bit to 1 to disable arbiter optimum weight function.
         */
        uint32_t out_arb_weight_opt_dis_chn:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} dma2d_out_conf0_chn_reg_t;

/** Type of out_int_raw_chn register
 *  Raw interrupt status of TX channel 0
 */
typedef union {
    struct {
        /** out_done_chn_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one outlink
         *  descriptor has been transmitted to peripherals for Tx channel 0.
         */
        uint32_t out_done_chn_int_raw:1;
        /** out_eof_chn_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one outlink
         *  descriptor has been read from memory for Tx channel 0.
         */
        uint32_t out_eof_chn_int_raw:1;
        /** out_dscr_err_chn_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw interrupt bit turns to high level when detecting outlink descriptor error,
         *  including owner error, the second and third word error of outlink descriptor for Tx
         *  channel 0.
         */
        uint32_t out_dscr_err_chn_int_raw:1;
        /** out_total_eof_chn_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw interrupt bit turns to high level when data corresponding a outlink
         *  (includes one link descriptor or few link descriptors) is transmitted out for Tx
         *  channel 0.
         */
        uint32_t out_total_eof_chn_int_raw:1;
        /** outfifo_ovf_l1_chn_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt bit turns to high level when fifo is overflow.
         */
        uint32_t outfifo_ovf_l1_chn_int_raw:1;
        /** outfifo_udf_l1_chn_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw interrupt bit turns to high level when fifo is underflow.
         */
        uint32_t outfifo_udf_l1_chn_int_raw:1;
        /** outfifo_ovf_l2_chn_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw interrupt bit turns to high level when fifo is overflow.
         */
        uint32_t outfifo_ovf_l2_chn_int_raw:1;
        /** outfifo_udf_l2_chn_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  The raw interrupt bit turns to high level when fifo is underflow.
         */
        uint32_t outfifo_udf_l2_chn_int_raw:1;
        /** outfifo_ovf_l3_chn_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  The raw interrupt bit turns to high level when fifo is overflow.
         */
        uint32_t outfifo_ovf_l3_chn_int_raw:1;
        /** outfifo_udf_l3_chn_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  The raw interrupt bit turns to high level when fifo is underflow.
         */
        uint32_t outfifo_udf_l3_chn_int_raw:1;
        /** outfifo_ro_ovf_chn_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  The raw interrupt bit turns to high level when reorder fifo is overflow.
         */
        uint32_t outfifo_ro_ovf_chn_int_raw:1;
        /** outfifo_ro_udf_chn_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  The raw interrupt bit turns to high level when reorder fifo is underflow.
         */
        uint32_t outfifo_ro_udf_chn_int_raw:1;
        /** out_dscr_task_ovf_chn_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  The raw interrupt bit turns to high level when dscr ready task fifo is overflow.
         */
        uint32_t out_dscr_task_ovf_chn_int_raw:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} dma2d_out_int_raw_chn_reg_t;

/** Type of out_int_ena_chn register
 *  Interrupt enable bits of TX channel 0
 */
typedef union {
    struct {
        /** out_done_chn_int_ena : R/W; bitpos: [0]; default: 0;
         *  The interrupt enable bit for the OUT_DONE_CH_INT interrupt.
         */
        uint32_t out_done_chn_int_ena:1;
        /** out_eof_chn_int_ena : R/W; bitpos: [1]; default: 0;
         *  The interrupt enable bit for the OUT_EOF_CH_INT interrupt.
         */
        uint32_t out_eof_chn_int_ena:1;
        /** out_dscr_err_chn_int_ena : R/W; bitpos: [2]; default: 0;
         *  The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t out_dscr_err_chn_int_ena:1;
        /** out_total_eof_chn_int_ena : R/W; bitpos: [3]; default: 0;
         *  The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.
         */
        uint32_t out_total_eof_chn_int_ena:1;
        /** outfifo_ovf_l1_chn_int_ena : R/W; bitpos: [4]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l1_chn_int_ena:1;
        /** outfifo_udf_l1_chn_int_ena : R/W; bitpos: [5]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l1_chn_int_ena:1;
        /** outfifo_ovf_l2_chn_int_ena : R/W; bitpos: [6]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l2_chn_int_ena:1;
        /** outfifo_udf_l2_chn_int_ena : R/W; bitpos: [7]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l2_chn_int_ena:1;
        /** outfifo_ovf_l3_chn_int_ena : R/W; bitpos: [8]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l3_chn_int_ena:1;
        /** outfifo_udf_l3_chn_int_ena : R/W; bitpos: [9]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l3_chn_int_ena:1;
        /** outfifo_ro_ovf_chn_int_ena : R/W; bitpos: [10]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_RO_OVF_CH_INT interrupt.
         */
        uint32_t outfifo_ro_ovf_chn_int_ena:1;
        /** outfifo_ro_udf_chn_int_ena : R/W; bitpos: [11]; default: 0;
         *  The interrupt enable bit for the OUTFIFO_RO_UDF_CH_INT interrupt.
         */
        uint32_t outfifo_ro_udf_chn_int_ena:1;
        /** out_dscr_task_ovf_chn_int_ena : R/W; bitpos: [12]; default: 0;
         *  The interrupt enable bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.
         */
        uint32_t out_dscr_task_ovf_chn_int_ena:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} dma2d_out_int_ena_chn_reg_t;

/** Type of out_int_st_chn register
 *  Masked interrupt status of TX channel 0
 */
typedef union {
    struct {
        /** out_done_chn_int_st : RO; bitpos: [0]; default: 0;
         *  The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.
         */
        uint32_t out_done_chn_int_st:1;
        /** out_eof_chn_int_st : RO; bitpos: [1]; default: 0;
         *  The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.
         */
        uint32_t out_eof_chn_int_st:1;
        /** out_dscr_err_chn_int_st : RO; bitpos: [2]; default: 0;
         *  The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t out_dscr_err_chn_int_st:1;
        /** out_total_eof_chn_int_st : RO; bitpos: [3]; default: 0;
         *  The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.
         */
        uint32_t out_total_eof_chn_int_st:1;
        /** outfifo_ovf_l1_chn_int_st : RO; bitpos: [4]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l1_chn_int_st:1;
        /** outfifo_udf_l1_chn_int_st : RO; bitpos: [5]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l1_chn_int_st:1;
        /** outfifo_ovf_l2_chn_int_st : RO; bitpos: [6]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l2_chn_int_st:1;
        /** outfifo_udf_l2_chn_int_st : RO; bitpos: [7]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l2_chn_int_st:1;
        /** outfifo_ovf_l3_chn_int_st : RO; bitpos: [8]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l3_chn_int_st:1;
        /** outfifo_udf_l3_chn_int_st : RO; bitpos: [9]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l3_chn_int_st:1;
        /** outfifo_ro_ovf_chn_int_st : RO; bitpos: [10]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_RO_OVF_CH_INT interrupt.
         */
        uint32_t outfifo_ro_ovf_chn_int_st:1;
        /** outfifo_ro_udf_chn_int_st : RO; bitpos: [11]; default: 0;
         *  The raw interrupt status bit for the OUTFIFO_RO_UDF_CH_INT interrupt.
         */
        uint32_t outfifo_ro_udf_chn_int_st:1;
        /** out_dscr_task_ovf_chn_int_st : RO; bitpos: [12]; default: 0;
         *  The raw interrupt status bit for the OUT_DSCR_TASK_OVF_CH_INT interrupt.
         */
        uint32_t out_dscr_task_ovf_chn_int_st:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} dma2d_out_int_st_chn_reg_t;

