espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dma2d_struct.h
/** Type of out_int_clr_chn register
 *  Interrupt clear bits of TX channel 0
 */
typedef union {
    struct {
        /** out_done_chn_int_clr : WT; bitpos: [0]; default: 0;
         *  Set this bit to clear the OUT_DONE_CH_INT interrupt.
         */
        uint32_t out_done_chn_int_clr:1;
        /** out_eof_chn_int_clr : WT; bitpos: [1]; default: 0;
         *  Set this bit to clear the OUT_EOF_CH_INT interrupt.
         */
        uint32_t out_eof_chn_int_clr:1;
        /** out_dscr_err_chn_int_clr : WT; bitpos: [2]; default: 0;
         *  Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t out_dscr_err_chn_int_clr:1;
        /** out_total_eof_chn_int_clr : WT; bitpos: [3]; default: 0;
         *  Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.
         */
        uint32_t out_total_eof_chn_int_clr:1;
        /** outfifo_ovf_l1_chn_int_clr : WT; bitpos: [4]; default: 0;
         *  Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l1_chn_int_clr:1;
        /** outfifo_udf_l1_chn_int_clr : WT; bitpos: [5]; default: 0;
         *  Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l1_chn_int_clr:1;
        /** outfifo_ovf_l2_chn_int_clr : WT; bitpos: [6]; default: 0;
         *  Set this bit to clear the OUTFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l2_chn_int_clr:1;
        /** outfifo_udf_l2_chn_int_clr : WT; bitpos: [7]; default: 0;
         *  Set this bit to clear the OUTFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l2_chn_int_clr:1;
        /** outfifo_ovf_l3_chn_int_clr : WT; bitpos: [8]; default: 0;
         *  Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_l3_chn_int_clr:1;
        /** outfifo_udf_l3_chn_int_clr : WT; bitpos: [9]; default: 0;
         *  Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.
         */
        uint32_t outfifo_udf_l3_chn_int_clr:1;
        /** outfifo_ro_ovf_chn_int_clr : WT; bitpos: [10]; default: 0;
         *  Set this bit to clear the OUTFIFO_RO_OVF_CH_INT interrupt.
         */
        uint32_t outfifo_ro_ovf_chn_int_clr:1;
        /** outfifo_ro_udf_chn_int_clr : WT; bitpos: [11]; default: 0;
         *  Set this bit to clear the OUTFIFO_RO_UDF_CH_INT interrupt.
         */
        uint32_t outfifo_ro_udf_chn_int_clr:1;
        /** out_dscr_task_ovf_chn_int_clr : WT; bitpos: [12]; default: 0;
         *  Set this bit to clear the OUT_DSCR_TASK_OVF_CH_INT interrupt.
         */
        uint32_t out_dscr_task_ovf_chn_int_clr:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} dma2d_out_int_clr_chn_reg_t;

/** Type of outfifo_status_chn register
 *  Represents the status of the tx fifo of channel 0
 */
typedef union {
    struct {
        /** outfifo_full_l2_chn : RO; bitpos: [0]; default: 0;
         *  Tx FIFO full signal for Tx channel 0.
         */
        uint32_t outfifo_full_l2_chn:1;
        /** outfifo_empty_l2_chn : RO; bitpos: [1]; default: 1;
         *  Tx FIFO empty signal for Tx channel 0.
         */
        uint32_t outfifo_empty_l2_chn:1;
        /** outfifo_cnt_l2_chn : RO; bitpos: [5:2]; default: 0;
         *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
         */
        uint32_t outfifo_cnt_l2_chn:4;
        uint32_t reserved_6:1;
        /** out_remain_under_1b_chn : RO; bitpos: [7]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_1b_chn:1;
        /** out_remain_under_2b_chn : RO; bitpos: [8]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_2b_chn:1;
        /** out_remain_under_3b_chn : RO; bitpos: [9]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_3b_chn:1;
        /** out_remain_under_4b_chn : RO; bitpos: [10]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_4b_chn:1;
        /** out_remain_under_5b_chn : RO; bitpos: [11]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_5b_chn:1;
        /** out_remain_under_6b_chn : RO; bitpos: [12]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_6b_chn:1;
        /** out_remain_under_7b_chn : RO; bitpos: [13]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_7b_chn:1;
        /** out_remain_under_8b_chn : RO; bitpos: [14]; default: 1;
         *  reserved
         */
        uint32_t out_remain_under_8b_chn:1;
        /** outfifo_full_l1_chn : RO; bitpos: [15]; default: 0;
         *  Tx FIFO full signal for Tx channel 0.
         */
        uint32_t outfifo_full_l1_chn:1;
        /** outfifo_empty_l1_chn : RO; bitpos: [16]; default: 1;
         *  Tx FIFO empty signal for Tx channel 0.
         */
        uint32_t outfifo_empty_l1_chn:1;
        /** outfifo_cnt_l1_chn : RO; bitpos: [21:17]; default: 0;
         *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
         */
        uint32_t outfifo_cnt_l1_chn:5;
        /** outfifo_full_l3_chn : RO; bitpos: [22]; default: 0;
         *  Tx FIFO full signal for Tx channel 0.
         */
        uint32_t outfifo_full_l3_chn:1;
        /** outfifo_empty_l3_chn : RO; bitpos: [23]; default: 1;
         *  Tx FIFO empty signal for Tx channel 0.
         */
        uint32_t outfifo_empty_l3_chn:1;
        /** outfifo_cnt_l3_chn : RO; bitpos: [28:24]; default: 0;
         *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
         */
        uint32_t outfifo_cnt_l3_chn:5;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} dma2d_outfifo_status_chn_reg_t;

/** Type of out_push_chn register
 *  Configures the tx fifo of channel 0
 */
typedef union {
    struct {
        /** outfifo_wdata_chn : R/W; bitpos: [9:0]; default: 0;
         *  This register stores the data that need to be pushed into DMA Tx FIFO.
         */
        uint32_t outfifo_wdata_chn:10;
        /** outfifo_push_chn : R/W/SC; bitpos: [10]; default: 0;
         *  Set this bit to push data into DMA Tx FIFO.
         */
        uint32_t outfifo_push_chn:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} dma2d_out_push_chn_reg_t;

/** Type of out_link_conf_chn register
 *  Configures the tx descriptor operations of channel 0
 */
typedef union {
    struct {
        uint32_t reserved_0:20;
        /** outlink_stop_chn : R/W/SC; bitpos: [20]; default: 0;
         *  Set this bit to stop dealing with the outlink descriptors.
         */
        uint32_t outlink_stop_chn:1;
        /** outlink_start_chn : R/W/SC; bitpos: [21]; default: 0;
         *  Set this bit to start dealing with the outlink descriptors.
         */
        uint32_t outlink_start_chn:1;
        /** outlink_restart_chn : R/W/SC; bitpos: [22]; default: 0;
         *  Set this bit to restart a new outlink from the last address.
         */
        uint32_t outlink_restart_chn:1;
        /** outlink_park_chn : RO; bitpos: [23]; default: 1;
         *  1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM
         *  is working.
         */
        uint32_t outlink_park_chn:1;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} dma2d_out_link_conf_chn_reg_t;

