espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dma2d_struct.h
/** Type of out_link_addr_chn register
 *  Configures the tx descriptor address of channel 0
 */
typedef union {
    struct {
        /** outlink_addr_chn : R/W; bitpos: [31:0]; default: 0;
         *  This register stores the first outlink descriptor's address.
         */
        uint32_t outlink_addr_chn:32;
    };
    uint32_t val;
} dma2d_out_link_addr_chn_reg_t;

/** Type of out_state_chn register
 *  Represents the working status of the tx descriptor of channel 0
 */
typedef union {
    struct {
        /** outlink_dscr_addr_chn : RO; bitpos: [17:0]; default: 0;
         *  This register stores the current outlink descriptor's address.
         */
        uint32_t outlink_dscr_addr_chn:18;
        /** out_dscr_state_chn : RO; bitpos: [19:18]; default: 0;
         *  This register stores the current descriptor state machine state.
         */
        uint32_t out_dscr_state_chn:2;
        /** out_state_chn : RO; bitpos: [23:20]; default: 0;
         *  This register stores the current control module state machine state.
         */
        uint32_t out_state_chn:4;
        /** out_reset_avail_chn : RO; bitpos: [24]; default: 1;
         *  This register indicate that if the channel reset is safety.
         */
        uint32_t out_reset_avail_chn:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} dma2d_out_state_chn_reg_t;

/** Type of out_eof_des_addr_chn register
 *  Represents the address associated with the outlink descriptor of channel 0
 */
typedef union {
    struct {
        /** out_eof_des_addr_chn : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the outlink descriptor when the EOF bit in this
         *  descriptor is 1.
         */
        uint32_t out_eof_des_addr_chn:32;
    };
    uint32_t val;
} dma2d_out_eof_des_addr_chn_reg_t;

/** Type of out_dscr_chn register
 *  Represents the address associated with the outlink descriptor of channel 0
 */
typedef union {
    struct {
        /** outlink_dscr_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the next outlink descriptor address y.
         */
        uint32_t outlink_dscr_chn:32;
    };
    uint32_t val;
} dma2d_out_dscr_chn_reg_t;

/** Type of out_dscr_bf0_chn register
 *  Represents the address associated with the outlink descriptor of channel 0
 */
typedef union {
    struct {
        /** outlink_dscr_bf0_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the last outlink descriptor's next address y-1.
         */
        uint32_t outlink_dscr_bf0_chn:32;
    };
    uint32_t val;
} dma2d_out_dscr_bf0_chn_reg_t;

/** Type of out_dscr_bf1_chn register
 *  Represents the address associated with the outlink descriptor of channel 0
 */
typedef union {
    struct {
        /** outlink_dscr_bf1_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the second-to-last outlink descriptor's next address y-2.
         */
        uint32_t outlink_dscr_bf1_chn:32;
    };
    uint32_t val;
} dma2d_out_dscr_bf1_chn_reg_t;

/** Type of out_peri_sel_chn register
 *  Configures the tx peripheral of channel 0
 */
typedef union {
    struct {
        /** out_peri_sel_chn : R/W; bitpos: [2:0]; default: 7;
         *  This register is used to select peripheral for Tx channel   0:  jpeg     1:
         *  display-1     2: display-2     3: display-3      7: no choose
         */
        uint32_t out_peri_sel_chn:3;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} dma2d_out_peri_sel_chn_reg_t;

/** Type of out_arb_chn register
 *  Configures the tx arbiter of channel 0
 */
typedef union {
    struct {
        /** out_arb_token_num_chn : R/W; bitpos: [3:0]; default: 1;
         *  Set the max number of token count of arbiter
         */
        uint32_t out_arb_token_num_chn:4;
        /** out_arb_priority_chn : R/W; bitpos: [5:4]; default: 1;
         *  Set the priority of channel
         */
        uint32_t out_arb_priority_chn:2;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} dma2d_out_arb_chn_reg_t;

/** Type of out_ro_status_chn register
 *  Represents the status of the tx reorder module of channel 0
 */
typedef union {
    struct {
        /** outfifo_ro_cnt_chn : RO; bitpos: [5:0]; default: 0;
         *  The register stores the byte number of the data in color convert Tx FIFO for
         *  channel 0.
         */
        uint32_t outfifo_ro_cnt_chn:6;
        /** out_ro_wr_state_chn : RO; bitpos: [7:6]; default: 0;
         *  The register stores the state of read ram of reorder
         */
        uint32_t out_ro_wr_state_chn:2;
        /** out_ro_rd_state_chn : RO; bitpos: [9:8]; default: 0;
         *  The register stores the state of write ram of reorder
         */
        uint32_t out_ro_rd_state_chn:2;
        /** out_pixel_byte_chn : RO; bitpos: [13:10]; default: 0;
         *  the number of bytes contained in a pixel at TX channel     0: 1byte     1: 1.5bytes
         *  2 : 2bytes     3: 2.5bytes     4: 3bytes     5: 4bytes
         */
        uint32_t out_pixel_byte_chn:4;
        /** out_burst_block_num_chn : RO; bitpos: [17:14]; default: 0;
         *  the number of macro blocks contained in a burst of data at TX channel
         */
        uint32_t out_burst_block_num_chn:4;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} dma2d_out_ro_status_chn_reg_t;

/** Type of out_ro_pd_conf_chn register
 *  Configures the tx reorder memory of channel 0
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** out_ro_ram_force_pd_chn : R/W; bitpos: [4]; default: 0;
         *  dma reorder ram power down
         */
        uint32_t out_ro_ram_force_pd_chn:1;
        /** out_ro_ram_force_pu_chn : R/W; bitpos: [5]; default: 1;
         *  dma reorder ram power up
         */
        uint32_t out_ro_ram_force_pu_chn:1;
        /** out_ro_ram_clk_fo_chn : R/W; bitpos: [6]; default: 0;
         *  1: Force to open the clock and bypass the gate-clock when accessing the RAM in DMA.
         *  0: A gate-clock will be used when accessing the RAM in DMA.
         */
        uint32_t out_ro_ram_clk_fo_chn:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} dma2d_out_ro_pd_conf_chn_reg_t;

/** Type of out_color_convert_chn register
 *  Configures the tx color convert of channel 0
 */
typedef union {
    struct {
        /** out_color_output_sel_chn : R/W; bitpos: [1:0]; default: 0;
         *  Set final color convert process and output type    0: RGB888 to RGB565     1:
         *  YUV444 to YUV422     2: output directly
         */
        uint32_t out_color_output_sel_chn:2;
        /** out_color_3b_proc_en_chn : R/W; bitpos: [2]; default: 0;
         *  Enable generic color convert module between color input & color output, need to
         *  configure parameter.
         */
        uint32_t out_color_3b_proc_en_chn:1;
        /** out_color_input_sel_chn : R/W; bitpos: [5:3]; default: 7;
         *  Set first color convert process and input color type    0: RGB565 to RGB888     1:
         *  YUV422 to YUV444      2: Other 2byte/pixel type    3: Other 3byte/pixel type    7:
         *  disable color space convert
         */
        uint32_t out_color_input_sel_chn:3;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} dma2d_out_color_convert_chn_reg_t;

