espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dma2d_struct.h
/** Type of out_scramble_chn register
 *  Configures the tx scramble of channel 0
 */
typedef union {
    struct {
        /** out_scramble_sel_pre_chn : R/W; bitpos: [2:0]; default: 0;
         *  Scramble data before color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 :
         *  BYTE1-0-2    3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2
         */
        uint32_t out_scramble_sel_pre_chn:3;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} dma2d_out_scramble_chn_reg_t;

/** Type of out_etm_conf_chn register
 *  Configures the tx etm of channel 0
 */
typedef union {
    struct {
        /** out_etm_en_chn : R/W; bitpos: [0]; default: 0;
         *  Configures the enable of the etm function, 1 is enable.
         */
        uint32_t out_etm_en_chn:1;
        /** out_etm_loop_en_chn : R/W; bitpos: [1]; default: 0;
         *  Configures the enable of the descriptors loop etm function, 1 is enable.
         */
        uint32_t out_etm_loop_en_chn:1;
        /** out_dscr_task_mak_chn : R/W; bitpos: [3:2]; default: 1;
         *  Configures the maximum number of cacheable descriptors.
         */
        uint32_t out_dscr_task_mak_chn:2;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} dma2d_out_etm_conf_chn_reg_t;

/** Type of out_dscr_port_blk_chn register
 *  Configures the tx block size in dscr port mode
 */
typedef union {
    struct {
        /** out_dscr_port_blk_h_chn : R/W; bitpos: [13:0]; default: 18;
         *  Set the horizontal width of tx block size in dscr port mode
         */
        uint32_t out_dscr_port_blk_h_chn:14;
        /** out_dscr_port_blk_v_chn : R/W; bitpos: [27:14]; default: 18;
         *  Set the vertical height of tx block size in dscr port mode
         */
        uint32_t out_dscr_port_blk_v_chn:14;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} dma2d_out_dscr_port_blk_chn_reg_t;


/** Group: in */
/** Type of in_conf0_chn register
 *  Configures the rx direction of channel 0
 */
typedef union {
    struct {
        /** in_mem_trans_en_chn : R/W; bitpos: [0]; default: 0;
         *  enable memory trans of the same channel
         */
        uint32_t in_mem_trans_en_chn:1;
        uint32_t reserved_1:1;
        /** indscr_burst_en_chn : R/W; bitpos: [2]; default: 0;
         *  Set this bit to 1 to enable INCR burst transfer for Rx transmitting link descriptor
         *  when accessing SRAM.
         */
        uint32_t indscr_burst_en_chn:1;
        /** in_ecc_aes_en_chn : R/W; bitpos: [3]; default: 0;
         *  When access address space is ecc/aes area, this bit should be set to 1. In this
         *  case, the start address of square should be 16-byte aligned. The width of square
         *  multiply byte number of one pixel should be 16-byte aligned.
         *
         *  2D-DMA w/ flash encryption enabled can still work properly even if this bit is not set to 1
         *  Meanwhile, enabling this bit will restrict addr and size in internal RAM also has to be 16-byte aligned
         *  Therefore, this bit is not used.
         */
        uint32_t in_ecc_aes_en_chn:1;
        /** in_check_owner_chn : R/W; bitpos: [4]; default: 0;
         *  Set this bit to enable checking the owner attribute of the link descriptor.
         */
        uint32_t in_check_owner_chn:1;
        /** in_loop_test_chn : R/W; bitpos: [5]; default: 0;
         *  reserved
         */
        uint32_t in_loop_test_chn:1;
        /** in_mem_burst_length_chn : R/W; bitpos: [8:6]; default: 0;
         *  Block size of Rx channel 0. 0: 8 bytes      1: 16 bytes      2: 32 bytes    3: 64
         *  bytes    4: 128 bytes
         */
        uint32_t in_mem_burst_length_chn:3;
        /** in_macro_block_size_chn : R/W; bitpos: [10:9]; default: 0;
         *  Sel RX macro-block size 0: 8pixel*8pixel     1: 8pixel*16pixel     2:
         *  16pixel*16pixel     3: no macro-block     , only useful in mode 1 of the link
         *  descriptor
         */
        uint32_t in_macro_block_size_chn:2;
        /** in_dscr_port_en_chn : R/W; bitpos: [11]; default: 0;
         *  Set this bit to 1 to obtain descriptor from IP port
         */
        uint32_t in_dscr_port_en_chn:1;
        /** in_page_bound_en_chn : R/W; bitpos: [12]; default: 0;
         *  Set this bit to 1 to make sure AXI write data don't cross the address boundary
         *  which define by mem_burst_length
         */
        uint32_t in_page_bound_en_chn:1;
        uint32_t reserved_13:3;
        /** in_reorder_en_chn : R/W; bitpos: [16]; default: 0;
         *  Enable RX channel 0 macro block reorder when set to 1, only channel0 have this
         *  selection
         */
        uint32_t in_reorder_en_chn:1;
        uint32_t reserved_17:7;
        /** in_rst_chn : R/W; bitpos: [24]; default: 0;
         *  Write 1 then write 0 to this bit to reset Rx channel
         */
        uint32_t in_rst_chn:1;
        /** in_cmd_disable_chn : R/W; bitpos: [25]; default: 0;
         *  Write 1 before reset and write 0 after reset
         */
        uint32_t in_cmd_disable_chn:1;
        /** in_arb_weight_opt_dis_chn : R/W; bitpos: [26]; default: 0;
         *  Set this bit to 1 to disable arbiter optimum weight function.
         */
        uint32_t in_arb_weight_opt_dis_chn:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} dma2d_in_conf0_chn_reg_t;

/** Type of in_int_raw_chn register
 *  Raw interrupt status of RX channel 0
 */
typedef union {
    struct {
        /** in_done_chn_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one inlink
         *  descriptor has been transmitted to peripherals for Rx channel 0.
         */
        uint32_t in_done_chn_int_raw:1;
        /** in_suc_eof_chn_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one inlink
         *  descriptor has been received and no data error is detected for Rx channel 0.
         */
        uint32_t in_suc_eof_chn_int_raw:1;
        /** in_err_eof_chn_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  The raw interrupt bit turns to high level when the last data pointed by one inlink
         *  descriptor has been received and data error is detected
         */
        uint32_t in_err_eof_chn_int_raw:1;
        /** in_dscr_err_chn_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  The raw interrupt bit turns to high level when detecting inlink descriptor error,
         *  including owner error, the second and third word error of inlink descriptor for Rx
         *  channel 0.
         */
        uint32_t in_dscr_err_chn_int_raw:1;
        /** infifo_ovf_l1_chn_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  The raw interrupt bit turns to high level when fifo of Rx channel is overflow.
         */
        uint32_t infifo_ovf_l1_chn_int_raw:1;
        /** infifo_udf_l1_chn_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw interrupt bit turns to high level when fifo of Rx channel is underflow.
         */
        uint32_t infifo_udf_l1_chn_int_raw:1;
        /** infifo_ovf_l2_chn_int_raw : R/WTC/SS; bitpos: [6]; default: 0;
         *  The raw interrupt bit turns to high level when fifo of Rx channel is overflow.
         */
        uint32_t infifo_ovf_l2_chn_int_raw:1;
        /** infifo_udf_l2_chn_int_raw : R/WTC/SS; bitpos: [7]; default: 0;
         *  The raw interrupt bit turns to high level when fifo of Rx channel is underflow.
         */
        uint32_t infifo_udf_l2_chn_int_raw:1;
        /** infifo_ovf_l3_chn_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  The raw interrupt bit turns to high level when fifo of Rx channel is overflow.
         */
        uint32_t infifo_ovf_l3_chn_int_raw:1;
        /** infifo_udf_l3_chn_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  The raw interrupt bit turns to high level when fifo of Rx channel is underflow.
         */
        uint32_t infifo_udf_l3_chn_int_raw:1;
        /** in_dscr_empty_chn_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  The raw interrupt bit turns to high level when the last descriptor is done but fifo
         *  also remain data.
         */
        uint32_t in_dscr_empty_chn_int_raw:1;
        /** infifo_ro_ovf_chn_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  The raw interrupt bit turns to high level when reorder fifo is overflow.
         */
        uint32_t infifo_ro_ovf_chn_int_raw:1;
        /** infifo_ro_udf_chn_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  The raw interrupt bit turns to high level when reorder fifo is underflow.
         */
        uint32_t infifo_ro_udf_chn_int_raw:1;
        /** in_dscr_task_ovf_chn_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  The raw interrupt bit turns to high level when dscr ready task fifo is overflow.
         */
        uint32_t in_dscr_task_ovf_chn_int_raw:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} dma2d_in_int_raw_chn_reg_t;

/** Type of in_int_ena_chn register
 *  Interrupt enable bits of RX channel 0
 */
typedef union {
    struct {
        /** in_done_chn_int_ena : R/W; bitpos: [0]; default: 0;
         *  The interrupt enable bit for the IN_DONE_CH_INT interrupt.
         */
        uint32_t in_done_chn_int_ena:1;
        /** in_suc_eof_chn_int_ena : R/W; bitpos: [1]; default: 0;
         *  The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.
         */
        uint32_t in_suc_eof_chn_int_ena:1;
        /** in_err_eof_chn_int_ena : R/W; bitpos: [2]; default: 0;
         *  The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.
         */
        uint32_t in_err_eof_chn_int_ena:1;
        /** in_dscr_err_chn_int_ena : R/W; bitpos: [3]; default: 0;
         *  The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t in_dscr_err_chn_int_ena:1;
        /** infifo_ovf_l1_chn_int_ena : R/W; bitpos: [4]; default: 0;
         *  The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l1_chn_int_ena:1;
        /** infifo_udf_l1_chn_int_ena : R/W; bitpos: [5]; default: 0;
         *  The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t infifo_udf_l1_chn_int_ena:1;
        /** infifo_ovf_l2_chn_int_ena : R/W; bitpos: [6]; default: 0;
         *  The interrupt enable bit for the INFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l2_chn_int_ena:1;
        /** infifo_udf_l2_chn_int_ena : R/W; bitpos: [7]; default: 0;
         *  The interrupt enable bit for the INFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t infifo_udf_l2_chn_int_ena:1;
        /** infifo_ovf_l3_chn_int_ena : R/W; bitpos: [8]; default: 0;
         *  The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l3_chn_int_ena:1;
        /** infifo_udf_l3_chn_int_ena : R/W; bitpos: [9]; default: 0;
         *  The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt.
         */
        uint32_t infifo_udf_l3_chn_int_ena:1;
        /** in_dscr_empty_chn_int_ena : R/W; bitpos: [10]; default: 0;
         *  The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.
         */
        uint32_t in_dscr_empty_chn_int_ena:1;
        /** infifo_ro_ovf_chn_int_ena : R/W; bitpos: [11]; default: 0;
         *  The interrupt enable bit for the INFIFO_RO_OVF_CH_INT interrupt.
         */
        uint32_t infifo_ro_ovf_chn_int_ena:1;
        /** infifo_ro_udf_chn_int_ena : R/W; bitpos: [12]; default: 0;
         *  The interrupt enable bit for the INFIFO_RO_UDF_CH_INT interrupt.
         */
        uint32_t infifo_ro_udf_chn_int_ena:1;
        /** in_dscr_task_ovf_chn_int_ena : R/W; bitpos: [13]; default: 0;
         *  The interrupt enable bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.
         */
        uint32_t in_dscr_task_ovf_chn_int_ena:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} dma2d_in_int_ena_chn_reg_t;

/** Type of in_int_st_chn register
 *  Masked interrupt status of RX channel 0
 */
typedef union {
    struct {
        /** in_done_chn_int_st : RO; bitpos: [0]; default: 0;
         *  The raw interrupt status bit for the IN_DONE_CH_INT interrupt.
         */
        uint32_t in_done_chn_int_st:1;
        /** in_suc_eof_chn_int_st : RO; bitpos: [1]; default: 0;
         *  The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.
         */
        uint32_t in_suc_eof_chn_int_st:1;
        /** in_err_eof_chn_int_st : RO; bitpos: [2]; default: 0;
         *  The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.
         */
        uint32_t in_err_eof_chn_int_st:1;
        /** in_dscr_err_chn_int_st : RO; bitpos: [3]; default: 0;
         *  The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t in_dscr_err_chn_int_st:1;
        /** infifo_ovf_l1_chn_int_st : RO; bitpos: [4]; default: 0;
         *  The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l1_chn_int_st:1;
        /** infifo_udf_l1_chn_int_st : RO; bitpos: [5]; default: 0;
         *  The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t infifo_udf_l1_chn_int_st:1;
        /** infifo_ovf_l2_chn_int_st : RO; bitpos: [6]; default: 0;
         *  The raw interrupt status bit for the INFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l2_chn_int_st:1;
        /** infifo_udf_l2_chn_int_st : RO; bitpos: [7]; default: 0;
         *  The raw interrupt status bit for the INFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t infifo_udf_l2_chn_int_st:1;
        /** infifo_ovf_l3_chn_int_st : RO; bitpos: [8]; default: 0;
         *  The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l3_chn_int_st:1;
        /** infifo_udf_l3_chn_int_st : RO; bitpos: [9]; default: 0;
         *  The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt.
         */
        uint32_t infifo_udf_l3_chn_int_st:1;
        /** in_dscr_empty_chn_int_st : RO; bitpos: [10]; default: 0;
         *  The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.
         */
        uint32_t in_dscr_empty_chn_int_st:1;
        /** infifo_ro_ovf_chn_int_st : RO; bitpos: [11]; default: 0;
         *  The raw interrupt status bit for the INFIFO_RO_OVF_CH_INT interrupt.
         */
        uint32_t infifo_ro_ovf_chn_int_st:1;
        /** infifo_ro_udf_chn_int_st : RO; bitpos: [12]; default: 0;
         *  The raw interrupt status bit for the INFIFO_RO_UDF_CH_INT interrupt.
         */
        uint32_t infifo_ro_udf_chn_int_st:1;
        /** in_dscr_task_ovf_chn_int_st : RO; bitpos: [13]; default: 0;
         *  The raw interrupt status bit for the IN_DSCR_TASK_OVF_CH_INT interrupt.
         */
        uint32_t in_dscr_task_ovf_chn_int_st:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} dma2d_in_int_st_chn_reg_t;

/** Type of in_int_clr_chn register
 *  Interrupt clear bits of RX channel 0
 */
typedef union {
    struct {
        /** in_done_chn_int_clr : WT; bitpos: [0]; default: 0;
         *  Set this bit to clear the IN_DONE_CH_INT interrupt.
         */
        uint32_t in_done_chn_int_clr:1;
        /** in_suc_eof_chn_int_clr : WT; bitpos: [1]; default: 0;
         *  Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.
         */
        uint32_t in_suc_eof_chn_int_clr:1;
        /** in_err_eof_chn_int_clr : WT; bitpos: [2]; default: 0;
         *  Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.
         */
        uint32_t in_err_eof_chn_int_clr:1;
        /** in_dscr_err_chn_int_clr : WT; bitpos: [3]; default: 0;
         *  Set this bit to clear the INDSCR_ERR_CH_INT interrupt.
         */
        uint32_t in_dscr_err_chn_int_clr:1;
        /** infifo_ovf_l1_chn_int_clr : WT; bitpos: [4]; default: 0;
         *  Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l1_chn_int_clr:1;
        /** infifo_udf_l1_chn_int_clr : WT; bitpos: [5]; default: 0;
         *  Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t infifo_udf_l1_chn_int_clr:1;
        /** infifo_ovf_l2_chn_int_clr : WT; bitpos: [6]; default: 0;
         *  Set this bit to clear the INFIFO_OVF_L2_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l2_chn_int_clr:1;
        /** infifo_udf_l2_chn_int_clr : WT; bitpos: [7]; default: 0;
         *  Set this bit to clear the INFIFO_UDF_L2_CH_INT interrupt.
         */
        uint32_t infifo_udf_l2_chn_int_clr:1;
        /** infifo_ovf_l3_chn_int_clr : WT; bitpos: [8]; default: 0;
         *  Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.
         */
        uint32_t infifo_ovf_l3_chn_int_clr:1;
        /** infifo_udf_l3_chn_int_clr : WT; bitpos: [9]; default: 0;
         *  Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.
         */
        uint32_t infifo_udf_l3_chn_int_clr:1;
        /** in_dscr_empty_chn_int_clr : WT; bitpos: [10]; default: 0;
         *  Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.
         */
        uint32_t in_dscr_empty_chn_int_clr:1;
        /** infifo_ro_ovf_chn_int_clr : WT; bitpos: [11]; default: 0;
         *  Set this bit to clear the INFIFO_RO_OVF_CH_INT interrupt.
         */
        uint32_t infifo_ro_ovf_chn_int_clr:1;
        /** infifo_ro_udf_chn_int_clr : WT; bitpos: [12]; default: 0;
         *  Set this bit to clear the INFIFO_RO_UDF_CH_INT interrupt.
         */
        uint32_t infifo_ro_udf_chn_int_clr:1;
        /** in_dscr_task_ovf_chn_int_clr : WT; bitpos: [13]; default: 0;
         *  Set this bit to clear the IN_DSCR_TASK_OVF_CH_INT interrupt.
         */
        uint32_t in_dscr_task_ovf_chn_int_clr:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} dma2d_in_int_clr_chn_reg_t;

/** Type of infifo_status_chn register
 *  Represents the status of the rx fifo of channel 0
 */
typedef union {
    struct {
        /** infifo_full_l2_chn : RO; bitpos: [0]; default: 0;
         *  Rx FIFO full signal for Rx channel.
         */
        uint32_t infifo_full_l2_chn:1;
        /** infifo_empty_l2_chn : RO; bitpos: [1]; default: 1;
         *  Rx FIFO empty signal for Rx channel.
         */
        uint32_t infifo_empty_l2_chn:1;
        /** infifo_cnt_l2_chn : RO; bitpos: [5:2]; default: 0;
         *  The register stores the byte number of the data in Rx FIFO for Rx channel.
         */
        uint32_t infifo_cnt_l2_chn:4;
        uint32_t reserved_6:1;
        /** in_remain_under_1b_chn : RO; bitpos: [7]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_1b_chn:1;
        /** in_remain_under_2b_chn : RO; bitpos: [8]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_2b_chn:1;
        /** in_remain_under_3b_chn : RO; bitpos: [9]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_3b_chn:1;
        /** in_remain_under_4b_chn : RO; bitpos: [10]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_4b_chn:1;
        /** in_remain_under_5b_chn : RO; bitpos: [11]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_5b_chn:1;
        /** in_remain_under_6b_chn : RO; bitpos: [12]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_6b_chn:1;
        /** in_remain_under_7b_chn : RO; bitpos: [13]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_7b_chn:1;
        /** in_remain_under_8b_chn : RO; bitpos: [14]; default: 0;
         *  reserved
         */
        uint32_t in_remain_under_8b_chn:1;
        /** infifo_full_l1_chn : RO; bitpos: [15]; default: 0;
         *  Tx FIFO full signal for Tx channel 0.
         */
        uint32_t infifo_full_l1_chn:1;
        /** infifo_empty_l1_chn : RO; bitpos: [16]; default: 1;
         *  Tx FIFO empty signal for Tx channel 0.
         */
        uint32_t infifo_empty_l1_chn:1;
        /** infifo_cnt_l1_chn : RO; bitpos: [21:17]; default: 0;
         *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
         */
        uint32_t infifo_cnt_l1_chn:5;
        /** infifo_full_l3_chn : RO; bitpos: [22]; default: 0;
         *  Tx FIFO full signal for Tx channel 0.
         */
        uint32_t infifo_full_l3_chn:1;
        /** infifo_empty_l3_chn : RO; bitpos: [23]; default: 1;
         *  Tx FIFO empty signal for Tx channel 0.
         */
        uint32_t infifo_empty_l3_chn:1;
        /** infifo_cnt_l3_chn : RO; bitpos: [28:24]; default: 0;
         *  The register stores the byte number of the data in Tx FIFO for Tx channel 0.
         */
        uint32_t infifo_cnt_l3_chn:5;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} dma2d_infifo_status_chn_reg_t;

