espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dma2d_struct.h
/** Type of in_pop_chn register
 *  Configures the rx fifo of channel 0
 */
typedef union {
    struct {
        /** infifo_rdata_chn : RO; bitpos: [10:0]; default: 1024;
         *  This register stores the data popping from DMA Rx FIFO.
         */
        uint32_t infifo_rdata_chn:11;
        /** infifo_pop_chn : R/W/SC; bitpos: [11]; default: 0;
         *  Set this bit to pop data from DMA Rx FIFO.
         */
        uint32_t infifo_pop_chn:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} dma2d_in_pop_chn_reg_t;

/** Type of in_link_conf_chn register
 *  Configures the rx descriptor operations of channel 0
 */
typedef union {
    struct {
        uint32_t reserved_0:20;
        /** inlink_auto_ret_chn : R/W; bitpos: [20]; default: 1;
         *  Configure the value of the owner field written back to the inlink descriptor.
         *  1: Write back 1. 0: Write back 0.
         */
        uint32_t inlink_auto_ret_chn:1;
        /** inlink_stop_chn : R/W/SC; bitpos: [21]; default: 0;
         *  Set this bit to stop dealing with the inlink descriptors.
         */
        uint32_t inlink_stop_chn:1;
        /** inlink_start_chn : R/W/SC; bitpos: [22]; default: 0;
         *  Set this bit to start dealing with the inlink descriptors.
         */
        uint32_t inlink_start_chn:1;
        /** inlink_restart_chn : R/W/SC; bitpos: [23]; default: 0;
         *  Set this bit to mount a new inlink descriptor.
         */
        uint32_t inlink_restart_chn:1;
        /** inlink_park_chn : RO; bitpos: [24]; default: 1;
         *  1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is
         *  working.
         */
        uint32_t inlink_park_chn:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} dma2d_in_link_conf_chn_reg_t;

/** Type of in_link_addr_chn register
 *  Configures the rx descriptor address of channel 0
 */
typedef union {
    struct {
        /** inlink_addr_chn : R/W; bitpos: [31:0]; default: 0;
         *  This register stores the first inlink descriptor's address.
         */
        uint32_t inlink_addr_chn:32;
    };
    uint32_t val;
} dma2d_in_link_addr_chn_reg_t;

/** Type of in_state_chn register
 *  Represents the working status of the rx descriptor of channel 0
 */
typedef union {
    struct {
        /** inlink_dscr_addr_chn : RO; bitpos: [17:0]; default: 0;
         *  This register stores the current inlink descriptor's address.
         */
        uint32_t inlink_dscr_addr_chn:18;
        /** in_dscr_state_chn : RO; bitpos: [19:18]; default: 0;
         *  reserved
         */
        uint32_t in_dscr_state_chn:2;
        /** in_state_chn : RO; bitpos: [22:20]; default: 0;
         *  reserved
         */
        uint32_t in_state_chn:3;
        /** in_reset_avail_chn : RO; bitpos: [23]; default: 1;
         *  This register indicate that if the channel reset is safety.
         */
        uint32_t in_reset_avail_chn:1;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} dma2d_in_state_chn_reg_t;

/** Type of in_suc_eof_des_addr_chn register
 *  Represents the address associated with the inlink descriptor of channel 0
 */
typedef union {
    struct {
        /** in_suc_eof_des_addr_chn : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the inlink descriptor when the EOF bit in this
         *  descriptor is 1.
         */
        uint32_t in_suc_eof_des_addr_chn:32;
    };
    uint32_t val;
} dma2d_in_suc_eof_des_addr_chn_reg_t;

/** Type of in_err_eof_des_addr_chn register
 *  Represents the address associated with the inlink descriptor of channel 0
 */
typedef union {
    struct {
        /** in_err_eof_des_addr_chn : RO; bitpos: [31:0]; default: 0;
         *  This register stores the address of the inlink descriptor when there are some
         *  errors in current receiving data.
         */
        uint32_t in_err_eof_des_addr_chn:32;
    };
    uint32_t val;
} dma2d_in_err_eof_des_addr_chn_reg_t;

/** Type of in_dscr_chn register
 *  Represents the address associated with the inlink descriptor of channel 0
 */
typedef union {
    struct {
        /** inlink_dscr_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the next inlink descriptor address x.
         */
        uint32_t inlink_dscr_chn:32;
    };
    uint32_t val;
} dma2d_in_dscr_chn_reg_t;

/** Type of in_dscr_bf0_chn register
 *  Represents the address associated with the inlink descriptor of channel 0
 */
typedef union {
    struct {
        /** inlink_dscr_bf0_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the last inlink descriptor's next address x-1.
         */
        uint32_t inlink_dscr_bf0_chn:32;
    };
    uint32_t val;
} dma2d_in_dscr_bf0_chn_reg_t;

/** Type of in_dscr_bf1_chn register
 *  Represents the address associated with the inlink descriptor of channel 0
 */
typedef union {
    struct {
        /** inlink_dscr_bf1_chn : RO; bitpos: [31:0]; default: 0;
         *  The address of the second-to-last inlink descriptor's next address x-2.
         */
        uint32_t inlink_dscr_bf1_chn:32;
    };
    uint32_t val;
} dma2d_in_dscr_bf1_chn_reg_t;

/** Type of in_peri_sel_chn register
 *  Configures the rx peripheral of channel 0
 */
typedef union {
    struct {
        /** in_peri_sel_chn : R/W; bitpos: [2:0]; default: 7;
         *  This register is used to select peripheral for Rx channel   0:  jpeg     1:
         *  display-1     2: display-2        7: no choose
         */
        uint32_t in_peri_sel_chn:3;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} dma2d_in_peri_sel_chn_reg_t;

/** Type of in_arb_chn register
 *  Configures the rx arbiter of channel 0
 */
typedef union {
    struct {
        /** in_arb_token_num_chn : R/W; bitpos: [3:0]; default: 1;
         *  Set the max number of token count of arbiter
         */
        uint32_t in_arb_token_num_chn:4;
        /** in_arb_priority_chn : R/W; bitpos: [4]; default: 1;
         *  Set the priority of channel
         */
        uint32_t in_arb_priority_chn:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} dma2d_in_arb_chn_reg_t;

/** Type of in_ro_status_chn register
 *  Represents the status of the rx reorder module of channel 0
 */
typedef union {
    struct {
        /** infifo_ro_cnt_chn : RO; bitpos: [4:0]; default: 0;
         *  The register stores the byte number of the data in color convert Rx FIFO for
         *  channel 0.
         */
        uint32_t infifo_ro_cnt_chn:5;
        /** in_ro_wr_state_chn : RO; bitpos: [6:5]; default: 0;
         *  The register stores the state of read ram of reorder
         */
        uint32_t in_ro_wr_state_chn:2;
        /** in_ro_rd_state_chn : RO; bitpos: [8:7]; default: 0;
         *  The register stores the state of write ram of reorder
         */
        uint32_t in_ro_rd_state_chn:2;
        /** in_pixel_byte_chn : RO; bitpos: [12:9]; default: 0;
         *  the number of bytes contained in a pixel at RX channel     0: 1byte     1: 1.5bytes
         *  2 : 2bytes     3: 2.5bytes     4: 3bytes     5: 4bytes
         */
        uint32_t in_pixel_byte_chn:4;
        /** in_burst_block_num_chn : RO; bitpos: [16:13]; default: 0;
         *  the number of macro blocks contained in a burst of data at RX channel
         */
        uint32_t in_burst_block_num_chn:4;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} dma2d_in_ro_status_chn_reg_t;

/** Type of in_ro_pd_conf_chn register
 *  Configures the rx reorder memory of channel 0
 */
typedef union {
    struct {
        uint32_t reserved_0:4;
        /** in_ro_ram_force_pd_chn : R/W; bitpos: [4]; default: 0;
         *  dma reorder ram power down
         */
        uint32_t in_ro_ram_force_pd_chn:1;
        /** in_ro_ram_force_pu_chn : R/W; bitpos: [5]; default: 1;
         *  dma reorder ram power up
         */
        uint32_t in_ro_ram_force_pu_chn:1;
        /** in_ro_ram_clk_fo_chn : R/W; bitpos: [6]; default: 0;
         *  1: Force to open the clock and bypass the gate-clock when accessing the RAM in DMA.
         *  0: A gate-clock will be used when accessing the RAM in DMA.
         */
        uint32_t in_ro_ram_clk_fo_chn:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} dma2d_in_ro_pd_conf_chn_reg_t;

