espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dma2d_struct.h
/** Type of in_color_convert_chn register
 *  Configures the tx color convert of channel 0
 */
typedef union {
    struct {
        /** in_color_output_sel_chn : R/W; bitpos: [1:0]; default: 0;
         *  Set final color convert process and output type    0: RGB888 to RGB565     1:
         *  output directly
         */
        uint32_t in_color_output_sel_chn:2;
        /** in_color_3b_proc_en_chn : R/W; bitpos: [2]; default: 0;
         *  Enable generic color convert module between color input & color output, need to
         *  configure parameter.
         */
        uint32_t in_color_3b_proc_en_chn:1;
        /** in_color_input_sel_chn : R/W; bitpos: [5:3]; default: 7;
         *  Set first color convert process and input color type    0: YUV422/420 to YUV444
         *  1: YUV422      2: YUV444/420      7: disable color space convert
         */
        uint32_t in_color_input_sel_chn:3;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} dma2d_in_color_convert_chn_reg_t;

/** Type of in_scramble_chn register
 *  Configures the rx scramble of channel 0
 */
typedef union {
    struct {
        /** in_scramble_sel_pre_chn : R/W; bitpos: [2:0]; default: 0;
         *  Scramble data before color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 :
         *  BYTE1-0-2    3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2
         */
        uint32_t in_scramble_sel_pre_chn:3;
        /** in_scramble_sel_post_chn : R/W; bitpos: [5:3]; default: 0;
         *  Scramble data after color convert :  0 : BYTE2-1-0   1 : BYTE2-0-1    2 : BYTE1-0-2
         *  3 : BYTE1-2-0    4 : BYTE0-2-1    5 : BYTE0-1-2
         */
        uint32_t in_scramble_sel_post_chn:3;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} dma2d_in_scramble_chn_reg_t;

/** Type of in_etm_conf_chn register
 *  Configures the rx etm of channel 0
 */
typedef union {
    struct {
        /** in_etm_en_chn : R/W; bitpos: [0]; default: 0;
         *  Configures the enable of the etm function, 1 is enable.
         */
        uint32_t in_etm_en_chn:1;
        /** in_etm_loop_en_chn : R/W; bitpos: [1]; default: 0;
         *  Configures the enable of the descriptors loop etm function, 1 is enable.
         */
        uint32_t in_etm_loop_en_chn:1;
        /** in_dscr_task_mak_chn : R/W; bitpos: [3:2]; default: 1;
         *  Configures the maximum number of cacheable descriptors.
         */
        uint32_t in_dscr_task_mak_chn:2;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} dma2d_in_etm_conf_chn_reg_t;


/** Group: Status Registers */
/** Type of axi_err register
 *  Represents the status of th axi bus
 */
typedef union {
    struct {
        /** rid_err_cnt : RO; bitpos: [3:0]; default: 0;
         *  AXI read id err cnt
         */
        uint32_t rid_err_cnt:4;
        /** rresp_err_cnt : RO; bitpos: [7:4]; default: 0;
         *  AXI read resp err cnt
         */
        uint32_t rresp_err_cnt:4;
        /** wresp_err_cnt : RO; bitpos: [11:8]; default: 0;
         *  AXI write resp err cnt
         */
        uint32_t wresp_err_cnt:4;
        /** rd_fifo_cnt : RO; bitpos: [14:12]; default: 0;
         *  AXI read cmd fifo remain cmd count
         */
        uint32_t rd_fifo_cnt:3;
        /** rd_bak_fifo_cnt : RO; bitpos: [18:15]; default: 0;
         *  AXI read backup cmd fifo remain cmd count
         */
        uint32_t rd_bak_fifo_cnt:4;
        /** wr_fifo_cnt : RO; bitpos: [21:19]; default: 0;
         *  AXI write cmd fifo remain cmd count
         */
        uint32_t wr_fifo_cnt:3;
        /** wr_bak_fifo_cnt : RO; bitpos: [25:22]; default: 0;
         *  AXI write backup cmd fifo remain cmd count
         */
        uint32_t wr_bak_fifo_cnt:4;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} dma2d_axi_err_reg_t;

/** Type of date register
 *  register version.
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [31:0]; default: 36716816;
         *  register version.
         */
        uint32_t date:32;
    };
    uint32_t val;
} dma2d_date_reg_t;


/** Group: Configuration Registers */
/** Type of rst_conf register
 *  Configures the reset of axi
 */
typedef union {
    struct {
        /** axim_rd_rst : R/W; bitpos: [0]; default: 0;
         *  Write 1 then write 0  to this bit to reset axi master read data FIFO.
         */
        uint32_t axim_rd_rst:1;
        /** axim_wr_rst : R/W; bitpos: [1]; default: 0;
         *  Write 1 then write 0  to this bit to reset axi master write data FIFO.
         */
        uint32_t axim_wr_rst:1;
        /** clk_en : R/W; bitpos: [2]; default: 0;
         *  1'h1: Force clock on for register. 1'h0: Support clock only when application writes
         *  registers.
         */
        uint32_t clk_en:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} dma2d_rst_conf_reg_t;

/** Type of intr_mem_start_addr register
 *  The start address of accessible address space.
 */
typedef union {
    struct {
        /** access_intr_mem_start_addr : R/W; bitpos: [31:0]; default: 806354944 (0x30100000);
         *  The start address of accessible address space.
         */
        uint32_t access_intr_mem_start_addr:32;
    };
    uint32_t val;
} dma2d_intr_mem_start_addr_reg_t;

/** Type of intr_mem_end_addr register
 *  The end address of accessible address space.
 */
typedef union {
    struct {
        /** access_intr_mem_end_addr : R/W; bitpos: [31:0]; default: 2415919103 (0x8FFFFFFF);
         *  The end address of accessible address space. The access address beyond this range
         *  would lead to descriptor error.
         */
        uint32_t access_intr_mem_end_addr:32;
    };
    uint32_t val;
} dma2d_intr_mem_end_addr_reg_t;

/** Type of extr_mem_start_addr register
 *  The start address of accessible address space.
 */
typedef union {
    struct {
        /** access_extr_mem_start_addr : R/W; bitpos: [31:0]; default: 806354944 (0x30100000);
         *  The start address of accessible address space.
         */
        uint32_t access_extr_mem_start_addr:32;
    };
    uint32_t val;
} dma2d_extr_mem_start_addr_reg_t;

/** Type of extr_mem_end_addr register
 *  The end address of accessible address space.
 */
typedef union {
    struct {
        /** access_extr_mem_end_addr : R/W; bitpos: [31:0]; default: 2415919103 (0x8FFFFFFF);
         *  The end address of accessible address space. The access address beyond this range
         *  would lead to descriptor error.
         */
        uint32_t access_extr_mem_end_addr:32;
    };
    uint32_t val;
} dma2d_extr_mem_end_addr_reg_t;

/** Type of out_arb_config register
 *  Configures the tx arbiter
 */
typedef union {
    struct {
        /** out_arb_timeout_num : R/W; bitpos: [15:0]; default: 0;
         *  Set the max number of timeout count of arbiter
         */
        uint32_t out_arb_timeout_num:16;
        /** out_weight_en : R/W; bitpos: [16]; default: 0;
         *  reserved
         */
        uint32_t out_weight_en:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} dma2d_out_arb_config_reg_t;

/** Type of in_arb_config register
 *  Configures the rx arbiter
 */
typedef union {
    struct {
        /** in_arb_timeout_num : R/W; bitpos: [15:0]; default: 0;
         *  Set the max number of timeout count of arbiter
         */
        uint32_t in_arb_timeout_num:16;
        /** in_weight_en : R/W; bitpos: [16]; default: 0;
         *  reserved
         */
        uint32_t in_weight_en:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} dma2d_in_arb_config_reg_t;

/** Type of rdn_result register
 *  reserved
 */
typedef union {
    struct {
        /** rdn_ena : R/W; bitpos: [0]; default: 0;
         *  reserved
         */
        uint32_t rdn_ena:1;
        /** rdn_result : RO; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t rdn_result:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} dma2d_rdn_result_reg_t;

/** Type of rdn_eco_high register
 *  reserved
 */
typedef union {
    struct {
        /** rdn_eco_high : R/W; bitpos: [31:0]; default: 4294967295;
         *  The start address of accessible address space.
         */
        uint32_t rdn_eco_high:32;
    };
    uint32_t val;
} dma2d_rdn_eco_high_reg_t;

/** Type of rdn_eco_low register
 *  reserved
 */
typedef union {
    struct {
        /** rdn_eco_low : R/W; bitpos: [31:0]; default: 0;
         *  The start address of accessible address space.
         */
        uint32_t rdn_eco_low:32;
    };
    uint32_t val;
} dma2d_rdn_eco_low_reg_t;


/** Type of in/out_color_param_h/m/l_chn register
 *  Configures the rx/tx color convert parameter of channel n
 */
typedef union {
    struct {
        struct {
            /** a: R/W; bitpos: [9:0]; default: h:298, m:298, l:298
             * Set the first parameter of the most/medium/least significant byte of pending 3 bytes
             */
            uint32_t a                             :    10;
            /** b: R/W; bitpos: [20:10]; default: h:0, in_m:1948, l:516
             * Set the second parameter of the most/medium/least significant byte of pending 3 bytes
             */
            uint32_t b                             :    11;
            uint32_t reserved21                    :    11;
        };
        struct {
            /** c: R/W; bitpos: [41:32]; default: h:409, m:816, l:0
             * Set the third parameter of the most/medium/least significant byte of pending 3 bytes
             */
            uint32_t c                             :    10;
            /** d: R/W; bitpos: [59:42]; default: h:205238, m:34707, l:191308
             * Set the fourth parameter of the most/medium/least significant byte of pending 3 bytes
             */
            uint32_t d                             :    18;
            uint32_t reserved60                    :    4;
        };
    };
    uint32_t val[2];
} dma2d_color_param_reg_t;

