espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/dma2d_struct.h
typedef struct {
    volatile dma2d_color_param_reg_t param_h;
    volatile dma2d_color_param_reg_t param_m;
    volatile dma2d_color_param_reg_t param_l;
} dma2d_color_param_group_chn_reg_t;

typedef struct {
    volatile dma2d_out_conf0_chn_reg_t out_conf0;
    volatile dma2d_out_int_raw_chn_reg_t out_int_raw;
    volatile dma2d_out_int_ena_chn_reg_t out_int_ena;
    volatile dma2d_out_int_st_chn_reg_t out_int_st;
    volatile dma2d_out_int_clr_chn_reg_t out_int_clr;
    volatile dma2d_outfifo_status_chn_reg_t outfifo_status;
    volatile dma2d_out_push_chn_reg_t out_push;
    volatile dma2d_out_link_conf_chn_reg_t out_link_conf;
    volatile dma2d_out_link_addr_chn_reg_t out_link_addr;
    volatile dma2d_out_state_chn_reg_t out_state;
    volatile dma2d_out_eof_des_addr_chn_reg_t out_eof_des_addr;
    volatile dma2d_out_dscr_chn_reg_t out_dscr;
    volatile dma2d_out_dscr_bf0_chn_reg_t out_dscr_bf0;
    volatile dma2d_out_dscr_bf1_chn_reg_t out_dscr_bf1;
    volatile dma2d_out_peri_sel_chn_reg_t out_peri_sel;
    volatile dma2d_out_arb_chn_reg_t out_arb;
    volatile dma2d_out_ro_status_chn_reg_t out_ro_status;
    volatile dma2d_out_ro_pd_conf_chn_reg_t out_ro_pd_conf;  /* only exist on channel0 */
    volatile dma2d_out_color_convert_chn_reg_t out_color_convert;
    volatile dma2d_out_scramble_chn_reg_t out_scramble;
    volatile dma2d_color_param_group_chn_reg_t out_color_param_group;
    volatile dma2d_out_etm_conf_chn_reg_t out_etm_conf;
    volatile dma2d_out_dscr_port_blk_chn_reg_t out_dscr_port_blk;
    uint32_t reserved_out[36];
} dma2d_out_chn_reg_t;

typedef struct {
    volatile dma2d_in_conf0_chn_reg_t in_conf0;
    volatile dma2d_in_int_raw_chn_reg_t in_int_raw;
    volatile dma2d_in_int_ena_chn_reg_t in_int_ena;
    volatile dma2d_in_int_st_chn_reg_t in_int_st;
    volatile dma2d_in_int_clr_chn_reg_t in_int_clr;
    volatile dma2d_infifo_status_chn_reg_t infifo_status;
    volatile dma2d_in_pop_chn_reg_t in_pop;
    volatile dma2d_in_link_conf_chn_reg_t in_link_conf;
    volatile dma2d_in_link_addr_chn_reg_t in_link_addr;
    volatile dma2d_in_state_chn_reg_t in_state;
    volatile dma2d_in_suc_eof_des_addr_chn_reg_t in_suc_eof_des_addr;
    volatile dma2d_in_err_eof_des_addr_chn_reg_t in_err_eof_des_addr;
    volatile dma2d_in_dscr_chn_reg_t in_dscr;
    volatile dma2d_in_dscr_bf0_chn_reg_t in_dscr_bf0;
    volatile dma2d_in_dscr_bf1_chn_reg_t in_dscr_bf1;
    volatile dma2d_in_peri_sel_chn_reg_t in_peri_sel;
    volatile dma2d_in_arb_chn_reg_t in_arb;
    volatile dma2d_in_ro_status_chn_reg_t in_ro_status;
    union {
        volatile dma2d_in_ro_pd_conf_chn_reg_t in_ro_pd_conf;             /* only exist on channel0 */
        volatile dma2d_in_etm_conf_chn_reg_t in1_etm_conf;                /* specific for channel1 */
    };
    volatile dma2d_in_color_convert_chn_reg_t in_color_convert;           /* only exist on channel0 */
    volatile dma2d_in_scramble_chn_reg_t in_scramble;                     /* only exist on channel0 */
    volatile dma2d_color_param_group_chn_reg_t in_color_param_group;      /* only exist on channel0 */
    volatile dma2d_in_etm_conf_chn_reg_t in_etm_conf;                     /* On ver. less than 3.0, channel 1 in_etm_conf register is at the in_ro_pd_conf addr. Here is to only be compatible with new ECOs. Workaround should be done in LL layer. */
    uint32_t reserved_in[36];
} dma2d_in_chn_reg_t;

typedef struct dma2d_dev_t {
    volatile dma2d_out_chn_reg_t out_channel[3];
    uint32_t reserved_300[128];
    volatile dma2d_in_chn_reg_t in_channel[2];
    uint32_t reserved_700[192];
    volatile dma2d_axi_err_reg_t axi_err;
    volatile dma2d_rst_conf_reg_t rst_conf;
    volatile dma2d_intr_mem_start_addr_reg_t intr_mem_start_addr;
    volatile dma2d_intr_mem_end_addr_reg_t intr_mem_end_addr;
    volatile dma2d_extr_mem_start_addr_reg_t extr_mem_start_addr;
    volatile dma2d_extr_mem_end_addr_reg_t extr_mem_end_addr;
    volatile dma2d_out_arb_config_reg_t out_arb_config;
    volatile dma2d_in_arb_config_reg_t in_arb_config;
    volatile dma2d_rdn_result_reg_t rdn_result;
    volatile dma2d_rdn_eco_high_reg_t rdn_eco_high;
    volatile dma2d_rdn_eco_low_reg_t rdn_eco_low;
    volatile dma2d_date_reg_t date;
} dma2d_dev_t;

extern dma2d_dev_t DMA2D;

#ifndef __cplusplus
_Static_assert(sizeof(dma2d_dev_t) == 0xa30, "Invalid size of dma2d_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
